<a href="https://colab.research.google.com/github/Err0rAltZero/trainingDIOPythonPanda/blob/main/trainingDIOPythonPandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [5]:
#dataframe
df1 = pd.read_excel("/content/drive/My Drive/DatasetsColab/Aracaju.xlsx")
df2 = pd.read_excel("/content/drive/My Drive/DatasetsColab/Fortaleza.xlsx")
df3 = pd.read_excel("/content/drive/My Drive/DatasetsColab/Natal.xlsx")
df4 = pd.read_excel("/content/drive/My Drive/DatasetsColab/Recife.xlsx")
df5 = pd.read_excel("/content/drive/My Drive/DatasetsColab/Salvador.xlsx")

In [7]:
df=pd.concat([df1,df2,df3,df4,df5])
df.head()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [8]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [11]:
df.sample(7)

        Cidade       Data  Vendas  LojaID  Qtde
161   Salvador 2019-01-02    5.80    1036     1
184      Natal 2019-01-02  167.16    1037     1
164   Salvador 2019-01-02    6.59    1035     1
72       Natal 2018-05-02  612.00     854     4
17    Salvador 2019-02-14  158.66    1037     1
73   Fortaleza 2019-01-01    3.10    1003     5
169   Salvador 2019-01-02  166.73    1037     2

In [13]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [14]:
df["LojaID"]=df["LojaID"].astype("object")

In [15]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [16]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

# Valores Faltantes

In [19]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
#Substituir valores nulos
#Média: df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)
#Zero: df["Vendas"].fillna(0, inplace=True)
#Apagar Linhas: df.dropna(inplace=True)

In [ ]:
#Apagar linhas com valores nulos com base apenas em 1 coluna
#df.dropna(subset=["Vendas"],inplace=True)

In [ ]:
#Remover linhas com valores faltantes em todas as colunas
#df.dropna(how="all", inplace=True)

# Criar Novas Colunas

In [20]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

In [23]:
#Coluna Receita
df["Receita"]=df["Vendas"].mul(df["Qtde"])
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [24]:
df["Receita/Vendas"] = df["Receita"]/df["Vendas"]
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [26]:
df["Receita"].max()

3544.0

In [28]:
df["Receita"].min()

3.34

In [29]:
df.nlargest(3,"Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [30]:
df.nsmallest(3,"Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [31]:
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [33]:
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

# Trabalhar Datas

In [34]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [35]:
df["Data"]=df["Data"].astype("int64")
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [39]:
df["Data"]=pd.to_datetime(df["Data"])
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [42]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [45]:
df["Ano_Venda"]=df["Data"].dt.year
df.sample(5)

        Cidade       Data  Vendas  ... Receita  Receita/Vendas  Ano_Venda
131     Recife 2019-03-02  139.07  ...  834.42             6.0       2019
38      Recife 2019-01-01  104.53  ...  418.12             4.0       2019
133  Fortaleza 2019-03-02   14.67  ...  102.69             7.0       2019
236      Natal 2019-01-03  126.29  ...  378.87             3.0       2019
76       Natal 2019-02-20  364.00  ...  728.00             2.0       2019

[5 rows x 8 columns]

In [50]:
#Extrair mês e dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)
df.sample(5)

       Cidade       Data  Vendas  ... Ano_Venda  mes_venda  dia_venda
84   Salvador 2019-01-01   22.99  ...      2019          1          1
222  Salvador 2019-01-02   43.96  ...      2019          1          2
76      Natal 2019-02-20  364.00  ...      2019          2         20
24     Recife 2019-01-01   13.00  ...      2019          1          1
169  Salvador 2019-01-02  166.73  ...      2019          1          2

[5 rows x 10 columns]

In [51]:
#Data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [53]:
#Diferença de dias
df["dif_dias"]=df["Data"]-df["Data"].min()
df.sample(5)

        Cidade       Data  Vendas  ... mes_venda  dia_venda  dif_dias
86   Fortaleza 2019-01-01   42.11  ...         1          1  365 days
18       Natal 2019-03-14  581.00  ...         3         14  437 days
171      Natal 2019-01-02  136.45  ...         1          2  366 days
48      Recife 2019-01-01  141.19  ...         1          1  365 days
36     Aracaju 2018-01-01   37.99  ...         1          1    0 days

[5 rows x 11 columns]

In [56]:
#Coluna trimestre
df["trimestre_venda"] = df["Data"].dt.quarter
df.sample(5)

       Cidade       Data  Vendas  ... dif_dias  semestre_venda  trimestre_venda
75     Recife 2019-01-01  170.29  ... 365 days               1                1
8      Recife 2019-02-11   56.47  ... 406 days               1                1
41     Recife 2019-02-13  157.78  ... 408 days               1                1
133  Salvador 2019-03-02  153.71  ... 425 days               1                1
11    Aracaju 2019-01-01  161.53  ... 365 days               1                1

[5 rows x 13 columns]

In [60]:
#Filtrar vendas: março 2019
vendas_marco_2019 = df.loc[(df["Data"].dt.year==2019)&(df["Data"].dt.month==3)]
vendas_marco_2019.sample(10)

       Cidade       Data  Vendas  ... dif_dias  semestre_venda  trimestre_venda
116    Recife 2019-03-02   79.10  ... 425 days               1                1
5       Natal 2019-03-30  674.00  ... 453 days               1                1
130  Salvador 2019-03-02   59.78  ... 425 days               1                1
109    Recife 2019-03-02   18.90  ... 425 days               1                1
118  Salvador 2019-03-02   92.21  ... 425 days               1                1
124  Salvador 2019-03-02   44.82  ... 425 days               1                1
108    Recife 2019-03-02  152.89  ... 425 days               1                1
132    Recife 2019-03-02   17.49  ... 425 days               1                1
131    Recife 2019-03-02  139.07  ... 425 days               1                1
74      Natal 2019-03-10  303.00  ... 433 days               1                1

[10 rows x 13 columns]